/* Used when showing an invalid entry or input encountered when expecting a formal entry such as a number of date */
"\\U201c%@\\U201d" = "“%@”";

/* NSKeyValueValidationError, message shown when the numeric value of user input is invalid (for example too small or too large) */
"Err1024-C" = "Giá trị không hợp lệ.";

/* NSKeyValueValidationError, message shown when the numeric value of user input is invalid (for example too small or too large) */
"Err1024-C.a" = "Giá trị %@ không hợp lệ.";

/* NSKeyValueValidationError, suggestion string when a numeric value of an user input is invalid (for example too small or too large) */
"Err1024-R" = "Hãy cung cấp một giá trị hợp lệ.";

/* NSFormattingError, message shown when the numeric value of an entry or input is invalid (for example too small or too large) */
"Err2048-C" = "Giá trị không hợp lệ.";

/* NSFormattingError, message shown when the numeric value of an entry or input is invalid (for example too small or too large) */
"Err2048-C.a" = "Giá trị %@ không hợp lệ.";

/* NSFormattingError, message shown when the numeric value of an entry or input is too small */
"Err2048-C.an" = "Giá trị quá nhỏ.";

/* NSFormattingError, message shown when the numeric value of an entry or input is too large */
"Err2048-C.ax" = "Giá trị quá lớn.";

/* NSFormattingError, suggestion string when a numeric value of an entry or input is invalid (for example too small or too large) */
"Err2048-R" = "Hãy cung cấp một giá trị hợp lệ.";

/* NSFormattingError, suggestion string when a numeric value of an entry or input is too small */
"Err2048-R.n" = "Hãy cung cấp một số không ngắn hơn %@.";

/* NSFormattingError, suggestion string when a numeric value of an entry or input is too small or too large */
"Err2048-R.nx" = "Hãy cung cấp một số giữa %1$@ và %2$@.";

/* NSFormattingError, suggestion string when a numeric value of an entry or input is too large */
"Err2048-R.x" = "Hãy cung cấp một số không dài hơn %@.";

/* NSFormattingError, message shown when the numeric value of an entry or input is invalid (for example too small or too large) */
"Err2048.an" = "Giá trị %@ quá nhỏ.";

/* NSFormattingError, message shown when the numeric value of an entry or input is invalid (for example too small or too large) */
"Err2048.ax" = "Giá trị %@ quá lớn.";

/* NSFileLockingError */
"Err255-C" = "Không thể khóa tệp.";

/* NSFileLockingError */
"Err255-R" = "Có thể tệp đã bị khóa, hoặc bạn không có quyền khóa tệp.";

/* NSFileLockingError, argument is a file name */
"Err255.f" = "Không thể khóa tệp “%@”.";

/* NSFileReadUnknownError */
"Err256" = "Không thể mở tệp.";

/* NSFileReadUnknownError, argument is a file name */
"Err256.f" = "Không thể mở tệp “%@”.";

/* NSFileReadNoPermissionError */
"Err257" = "Không thể mở tệp vì bạn không có quyền xem tệp đó.";

/* NSFileReadNoPermissionError */
"Err257-C" = "Bạn không có quyền.";

/* NSFileReadNoPermissionError; ; suggestion applies to files or folders, hence the use of the word item */
"Err257-R" = "Để xem hoặc thay đổi quyền, chọn mục trong Finder và chọn Tệp > Xem T.tin.";

/* NSFileReadNoPermissionError, argument is a file name */
"Err257.f" = "Không thể mở tệp “%@” vì bạn không có quyền xem tệp đó.";

/* NSFileReadInvalidFileNameError */
"Err258-C" = "Tên tệp không hợp lệ.";

/* NSFileReadInvalidFileNameError, argument is a file or folder name */
"Err258.f" = "Không thể mở mục này vì tên tệp “%@” không hợp lệ.";

/* NSFileReadCorruptFileError */
"Err259" = "Không thể mở tệp vì tệp không có định dạng đúng.";

/* NSFileReadCorruptFileError */
"Err259-C" = "Tệp không có định dạng đúng.";

/* NSFileReadCorruptFileError */
"Err259-R" = "Có thể tệp đã bị hỏng, cắt hoặc ở định dạng không mong muốn.";

/* NSFileReadCorruptFileError, argument is a file name */
"Err259.f" = "Không thể mở tệp “%@” vì tệp không có định dạng đúng.";

/* NSFileReadNoSuchFileError */
"Err260" = "Không thể mở tệp vì tệp đó không tồn tại.";

/* NSFileReadNoSuchFileError */
"Err260(Folder).f" = "Thư mục “%@” không tồn tại.";

/* NSFileReadNoSuchFileError */
"Err260-C" = "Tệp không tồn tại.";

/* NSFileReadNoSuchFileError */
"Err260-C(Folder)" = "Thư mục không tồn tại.";

/* NSFileReadNoSuchFileError, argument is a file name */
"Err260.f" = "Không thể mở tệp “%@” vì không có tệp đó.";

/* NSFileReadInapplicableStringEncodingError */
"Err261" = "Không thể mở tệp bằng mã hóa văn bản chỉ định.";

/* NSFileReadInapplicableStringEncodingError */
"Err261-C" = "Không thể áp dụng mã hóa văn bản được chỉ định.";

/* NSFileReadInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err261-C.e" = "Mã hóa văn bản %@ không được áp dụng.";

/* NSFileReadInapplicableStringEncodingError */
"Err261-R" = "Tệp có thể đã được lưu bằng mã hóa văn bản khác hoặc tệp không thể là tệp văn bản.";

/* NSFileReadInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err261.e" = "Không thể mở tệp bằng mã hóa văn bản %@.";

/* NSFileReadInapplicableStringEncodingError, arguments are file name and text encoding name (for instance 'Western (Mac OS Roman)' */
"Err261.ef" = "Không thể mở tệp “%2$@” bằng mã hóa văn bản %1$@.";

/* NSFileReadUnsupportedSchemeError */
"Err262" = "Không thể mở tệp vì loại URL chỉ định không được hỗ trợ.";

/* NSFileReadUnsupportedSchemeError */
"Err262-C" = "Loại URL cụ thể không được hỗ trợ.";

/* NSFileReadUnsupportedSchemeError, arguments are file name and URL scheme name (for instance ftp:) */
"Err262.fu" = "Không thể mở tệp “%1$@” vì loại URL %2$@ không được hỗ trợ.";

/* NSFileReadUnsupportedSchemeError, argument is URL scheme name (for instance ftp:) */
"Err262.u" = "Không thể mở tệp vì loại URL %@ không được hỗ trợ.";

/* NSFileReadTooLargeError */
"Err263" = "Không thể mở mục vì mục đó quá lớn.";

/* NSFileReadTooLargeError, reason string */
"Err263-C" = "Mục quá lớn.";

/* NSFileReadTooLargeError, argument is a file name */
"Err263.f" = "Không thể mở mục “%@” vì mục đó quá lớn.";

/* NSFileReadUnknownStringEncodingError */
"Err264" = "Không thể mở tệp vì không thể xác định mã hóa văn bản nội dung.";

/* NSFileReadUnknownStringEncodingError, reason string */
"Err264-C" = "Không thể xác định mã hóa văn bản của nội dung.";

/* NSFileReadUnknownStringEncodingError, recovery suggestion */
"Err264-R" = "Bạn có thể mở tệp bằng cách chỉ rõ mã hóa văn bản.";

/* NSFileReadUnknownStringEncodingError, argument is a file name */
"Err264.f" = "Không thể mở tệp “%@” vì không thể xác định mã hóa nội dung.";

/* NSUserCancelledError */
"Err3072-C" = "Đã hủy thao tác.";

/* NSFeatureUnsupportedError */
"Err3328" = "Không thể hoàn tất thao tác được yêu cầu vì tính năng này không được hỗ trợ.";

/* NSFeatureUnsupportedError, argument is a file name */
"Err3328(Trash).f" = "Không thể di chuyển “%@” đến thùng rác vì ổ đĩa không có thùng rác.";

/* NSFeatureUnsupportedError, argument is a file name and volume name */
"Err3328(Trash).fv" = "Không thể di chuyển “%1$@” đến thùng rác vì ổ đĩa \"%2$@\" không có thùng rác.";

/* NSFeatureUnsupportedError */
"Err3328-C" = "Thao tác đã yêu cầu không được hỗ trợ.";

/* NSFeatureUnsupportedError */
"Err3328-C(Trash)" = "Ổ đĩa không có thùng rác.";

/* NSPropertyListCorruptError */
"Err3840" = "Không thể đọc dữ liệu vì dữ liệu đã bị hỏng.";

/* NSPropertyListCorruptError */
"Err3840-C" = "Dữ liệu đã bị hỏng.";

/* NSPropertyListUnknownVersionError */
"Err3841" = "Không thể đọc dữ liệu vì dữ liệu ở định dạng mà ứng dụng này không hiểu.";

/* NSPropertyListUnknownVersionError */
"Err3841-C" = "Dữ liệu ở định dạng mà ứng dụng này không hiểu.";

/* NSPropertyListReadStreamError */
"Err3842" = "Không thể đọc dữ liệu vì lỗi trong nguồn dữ liệu.";

/* NSPropertyListReadStreamError */
"Err3842-C" = "Đã xảy ra lỗi trong nguồn đối với dữ liệu.";

/* NSPropertyListWriteStreamError */
"Err3851" = "Không thể viết dữ liệu vì lỗi trong đích đối với dữ liệu.";

/* NSPropertyListWriteStreamError */
"Err3851-C" = "Đã xảy ra lỗi trong đích đối với dữ liệu.";

/* NSFileNoSuchFileError, argument is a folder name */
"Err4(Folder).f" = "Thư mục “%@” không tồn tại.";

/* NSFileNoSuchFileError, first arg: source file, second arg: destination file */
"Err4(Move).fp" = "Không thể di chuyển “%1$@” sang “%2$@” vì hoặc mục đầu không tồn tại hoặc thư mục chứa mục sau không tồn tại.";

/* NSFileNoSuchFileError, argument is a file name */
"Err4(Remove).f" = "Không thể xóa “%@”.";

/* NSFileNoSuchFileError */
"Err4-C" = "Tệp không tồn tại.";

/* NSFileNoSuchFileError, applied to a folder */
"Err4-C(Folder)" = "Thư mục không tồn tại.";

/* NSFileNoSuchFileError, argument is a file name */
"Err4.f" = "Tệp “%@” không tồn tại.";

/* Message shown when the connection to a helper application is interrupted due to the helper application exiting. */
"Err4097" = "Không thể liên lạc với ứng dụng trợ giúp.";

/* Recovery suggestion for message shown when the connection to a helper application is interrupted. */
"Err4097-R" = "Thử lại thao tác của bạn. Nếu thất bại, hãy thoát và khởi chạy lại ứng dụng và thử lại.";

/* Message shown when the connection to a helper application is interrupted and can not be reestablished. */
"Err4099" = "Không thể liên lạc với ứng dụng trợ giúp.";

/* Recovery suggestion for message shown when the connection to a helper application is interrupted. */
"Err4099-R" = "Thử lại thao tác của bạn. Nếu thất bại, hãy thoát và khởi chạy lại ứng dụng và thử lại.";

/* Message shown when the connection to a helper application is invalidated due to a corrupted response. */
"Err4101" = "Không thể liên lạc với ứng dụng trợ giúp.";

/* Recovery suggestion for message shown when the connection to a helper application is interrupted. */
"Err4101-R" = "Thử lại thao tác của bạn. Nếu thất bại, hãy thoát và khởi chạy lại ứng dụng và thử lại.";

/* NSFileWriteUnknownError */
"Err512" = "Không thể lưu tệp.";

/* NSFileWriteUnknownError, when the save of the specified file fails because the backup file for the saved file can't be created or updated */
"Err512(Backup).f" = "Không thể lưu tệp “%1$@” vì không thể cập nhật tệp sao lưu.";

/* NSFileWriteUnknownError, first argument is the source, second argument is the destination */
"Err512(Copy).fp" = "Không thể sao chép “%1$@” sang “%2$@”.";

/* NSFileWriteUnknownError, first arg: source, second arg: destination */
"Err512(Link).fp" = "Không thể liên kết “%1$@” sang “%2$@”.";

/* NSFileWriteUnknownError, first arg: source file, second arg: destination file */
"Err512(Move).fp" = "Không thể di chuyển “%1$@” sang “%2$@”.";

/* NSFileWriteUnknownError, argument is a file name */
"Err512(Remove).f" = "Không thể xóa “%@”.";

/* NSFileWriteUnknownError, argument is a file name */
"Err512(Trash).f" = "Không thể di chuyển “%@” đến thùng rác.";

/* NSFileWriteUnknownError, when the save of a file fails because the backup file can't be created or updated */
"Err512-C(Backup)" = "Không thể lưu tệp sao lưu.";

/* NSFileWriteUnknownError, recovery suggestion for when the save of a file fails because the backup file can't be created or updated */
"Err512-R(Backup)" = "Tệp sao lưu có thể bị khóa, hoặc có thể bạn không có quyền lưu tệp đó. Để xem hoặc thay đổi quyền, chọn mục trong Finder và chọn Tệp > Xem T.tin.";

/* NSFileWriteUnknownError, arguments are folder name where the file was going to be saved, and file name */
"Err512.df" = "Không thể lưu tệp “%2$@” trong thư mục “%1$@”.";

/* NSFileWriteUnknownError, argument is a file name */
"Err512.f" = "Không thể lưu tệp “%@”.";

/* NSFileWriteNoPermissionError */
"Err513" = "Không thể lưu tệp vì bạn không có quyền.";

/* NSFileWriteNoPermissionError, first argument is the source, second argument is the destination */
"Err513(Copy).fp" = "Không thể sao chép “%1$@” vì bạn không có quyền truy cập “%2$@”.";

/* NSFileWriteNoPermissionError, first arg: source, second arg: destination */
"Err513(Link).fp" = "Không thể liên kết “%1$@” vì bạn không có quyền truy cập “%2$@”.";

/* NSFileWriteNoPermissionError, first arg: source file, second arg: destination file */
"Err513(Move).fp" = "Không thể di chuyển “%1$@” vì bạn không có quyền truy cập “%2$@”.";

/* NSFileWriteNoPermissionError, argument is a file name */
"Err513(Remove).f" = "Không thể di chuyển “%@” vì bạn không có quyền truy cập.";

/* NSFileWriteNoPermissionError, argument is a file name */
"Err513(Trash).f" = "Không thể di chuyển “%@” đến thùng rác vì bạn không có quyền truy cập.";

/* NSFileWriteNoPermissionError */
"Err513-C" = "Bạn không có quyền.";

/* NSFileWriteNoPermissionError; suggestion applies to files or folders, hence the use of the word item */
"Err513-R" = "Để xem hoặc thay đổi quyền, chọn mục trong Finder và chọn Tệp > Xem T.tin.";

/* NSFileWriteNoPermissionError, arguments are folder name where the file was going to be saved, and file name */
"Err513.df" = "Bạn không có quyền lưu tệp “%2$@” vào thư mục “%1$@”.";

/* NSFileWriteNoPermissionError, argument is a file name */
"Err513.f" = "Bạn không có quyền lưu tệp “%@”.";

/* NSFileWriteInvalidFileNameError */
"Err514" = "Không thể lưu mục này vì tên tệp không hợp lệ.";

/* NSFileWriteInvalidFileNameError, argument is a file name */
"Err514(Remove).f" = "Không thể xóa mục này vì tên tệp “%@” không hợp lệ.";

/* NSFileWriteInvalidFileNameError */
"Err514-C" = "Tên tệp không hợp lệ.";

/* NSFileWriteInvalidFileNameError, argument is a file or folder name */
"Err514.f" = "Không thể lưu mục này vì tên tệp “%@” không hợp lệ.";

/* NSFileWriteFileExistsError */
"Err516" = "Không thể lưu tệp vì tệp có cùng tên đã tồn tại.";

/* NSFileWriteFileExistsError, first arg: source, second arg: destination */
"Err516(Copy).fp" = "Không thể sao chép “%1$@” sang “%2$@” vì đã tồn tại một mục có cùng tên.";

/* NSFileWriteFileExistsError, first arg: source, second arg: destination */
"Err516(Link).fp" = "Không thể liên kết “%1$@” với “%2$@” vì đã tồn tại một mục có cùng tên.";

/* NSFileWriteFileExistsError, first arg: source, second arg: destination */
"Err516(Move).fp" = "Không thể di chuyển “%1$@” sang “%2$@” vì đã tồn tại một mục có cùng tên.";

/* NSFileWriteFileExistsError */
"Err516-C" = "Tệp có cùng tên đã tồn tại.";

/* NSFileWriteFileExistsError, argument is a file name */
"Err516-C.f" = "Tệp có tên “%@” đã tồn tại.";

/* NSFileWriteFileExistsError */
"Err516-R" = "Để lưu tệp, hãy cung cấp tên khác hoặc di chuyển sang cạnh hoặc xóa tệp hiện có và thử lại.";

/* NSFileWriteFileExistsError, first arg: destination folder, second arg: a file name */
"Err516.df" = "Không thể lưu tệp “%2$@” vào thư mục “%1$@” vì tệp có cùng tên đã tồn tại.";

/* NSFileWriteFileExistsError, argument is a file name */
"Err516.f" = "Không thể lưu tệp “%@” vì tệp có cùng tên đã tồn tại.";

/* NSFileWriteInapplicableStringEncodingError */
"Err517" = "Không thể lưu tệp bằng mã hóa văn bản chỉ định.";

/* NSFileWriteInapplicableStringEncodingError */
"Err517-C" = "Không thể áp dụng mã hóa văn bản được chỉ định.";

/* NSFileWriteInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err517-C.e" = "Mã hóa văn bản %@ không được áp dụng.";

/* NSFileWriteInapplicableStringEncodingError */
"Err517-R" = "Nếu có thể, chọn mã hóa văn bản khác.";

/* NSFileWriteInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err517.e" = "Không thể lưu tệp bằng mã hóa văn bản %@.";

/* NSFileWriteInapplicableStringEncodingError, arguments are file name and text encoding name (for instance 'Western (Mac OS Roman)' */
"Err517.ef" = "Không thể lưu tệp “%2$@” bằng mã hóa văn bản %1$@.";

/* NSFileWriteUnsupportedSchemeError */
"Err518" = "Không thể lưu tệp vì loại URL chỉ định không được hỗ trợ.";

/* NSFileWriteUnsupportedSchemeError */
"Err518-C" = "Loại URL cụ thể không được hỗ trợ.";

/* NSFileWriteUnsupportedSchemeError, arguments are file name and URL scheme name (for instance ftp:) */
"Err518.fu" = "Không thể lưu tệp “%1$@” vì loại URL %2$@ không được hỗ trợ.";

/* NSFileWriteUnsupportedSchemeError, argument is URL scheme name (for instance ftp:) */
"Err518.u" = "Không thể lưu tệp vì loại URL %@ không được hỗ trợ.";

/* NSFileWriteOutOfSpaceError */
"Err640" = "Không thể lưu tệp vì không có đủ bộ nhớ.";

/* NSFileWriteOutOfSpaceError, first arg: source, second arg: destination */
"Err640(Copy).fp" = "Không thể sao chép “%1$@” sang “%2$@” vì không đủ bộ nhớ.";

/* NSFileWriteOutOfSpaceError, first arg: source, second arg: destination */
"Err640(Link).fp" = "Không thể liên kết “%1$@” sang “%2$@” vì không đủ bộ nhớ.";

/* NSFileWriteOutOfSpaceError, first arg: source, second arg: destination */
"Err640(Move).fp" = "Không thể di chuyển “%1$@” sang “%2$@” vì không đủ bộ nhớ.";

/* NSFileWriteOutOfSpaceError, argument is a file name */
"Err640(Trash).f" = "Không thể di chuyển “%@” đến thùng rác vì không đủ bộ nhớ.";

/* NSFileWriteOutOfSpaceError */
"Err640-C" = "Không có đủ bộ nhớ.";

/* NSFileWriteOutOfSpaceError, argument is volume name */
"Err640-C.v" = "Ổ đĩa “%@” hết dung lượng.";

/* NSFileWriteOutOfSpaceError */
"Err640-R" = "Xóa bớt tệp từ ổ đĩa, rồi thử lại.";

/* NSFileWriteOutOfSpaceError, argument is a file name */
"Err640.f" = "Bạn không thể lưu tệp “%@” vì không đủ bộ nhớ.";

/* NSFileWriteOutOfSpaceError, arguments are file name and volume name */
"Err640.fv" = "Bạn không thể lưu tệp “%1$@” vì ổ đĩa “%2$@” hết dung lượng.";

/* NSFileWriteVolumeReadOnlyError */
"Err642" = "Không thể lưu tệp vì ổ đĩa là chỉ đọc.";

/* NSFileWriteVolumeReadOnlyError, argument is a file name */
"Err642(Trash).f" = "Không thể di chuyển “%@” đến thùng rác vì ổ đĩa ở dạng chỉ đọc.";

/* NSFileWriteVolumeReadOnlyError */
"Err642-C" = "Ổ đĩa là chỉ đọc.";

/* NSFileWriteVolumeReadOnlyError, argument is volume name */
"Err642-C.v" = "Ổ đĩa “%@” là chỉ đọc.";

/* NSFileWriteVolumeReadOnlyError */
"Err642-R" = "Thử lưu tệp vào ổ đĩa khác.";

/* NSFileWriteVolumeReadOnlyError, argument is a file name */
"Err642.f" = "Bạn không thể lưu tệp “%@” vì ổ đĩa là chỉ đọc.";

/* NSFileWriteVolumeReadOnlyError, arguments are file name and volume name */
"Err642.fv" = "Bạn không thể lưu tệp “%1$@” vì ổ đĩa “%2$@” là chỉ đọc.";

/* A fallback error message. %@ is the error domain name, %ld is the error number */
"The operation couldn\\U2019t be completed. (%1$@ error %2$ld.)" = "Không thể hoàn tất vận hành. (lỗi %1$@ %2$ld.)";

